In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
data = {'Country':['Belgium','India','Brazil'],
        'Capital':['Brussels','New Delhi','Brasilia'],
       'Population':[11190846,1303171035,207847520]}

# Series

In [7]:
s1 = pd.Series(data['Country'],index=['A','B','C'])

In [8]:
s1

A    Belgium
B      India
C     Brazil
dtype: object

In [9]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [10]:
s1.index

Index(['A', 'B', 'C'], dtype='object')

# DataFrame

In [11]:
df1 = pd.DataFrame(data)

In [25]:
df1

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847520

In [26]:
cou = df1['Country']

In [27]:
cou

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [28]:
type(cou)

pandas.core.series.Series

In [29]:
df1.iterrows()

In [31]:
for row in df1.iterrows():
    print(row[0],row[1])

0 Capital       Brussels
Country        Belgium
Population    11190846
Name: 0, dtype: object
1 Capital        New Delhi
Country            India
Population    1303171035
Name: 1, dtype: object
2 Capital        Brasilia
Country          Brazil
Population    207847520
Name: 2, dtype: object

In [32]:
df1

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847520

In [33]:
data

{'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Country': ['Belgium', 'India', 'Brazil'],
 'Population': [11190846, 1303171035, 207847520]}

In [34]:
s1 = pd.Series(data['Capital'])
s2 = pd.Series(data['Country'])
s3 = pd.Series(data['Population'])

In [42]:
df_new = pd.DataFrame([s1,s2,s3],index=['Capital','Country','Population'])

In [43]:
df_new = df_new.T

In [44]:
df_new

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847520

In [41]:
df1

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilia   Brazil   207847520